; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-6-3-4-12)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5
    shape0 shape1 shape2
    key0 key1 key2 key3
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos0-5)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos1-5)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos2-5)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (key key0)
       (key key1)
       (key key2)
       (key key3)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-5)
       (conn pos0-4 pos0-3)
       (conn pos0-5 pos1-5)
       (conn pos0-5 pos0-4)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos1-5)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos1-5 pos2-5)
       (conn pos1-5 pos0-5)
       (conn pos1-5 pos1-4)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos2-5)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos2-5 pos1-5)
       (conn pos2-5 pos2-4)
       (locked pos1-3)
       (locked pos2-4)
       (locked pos1-4)
       (locked pos2-5)
       (locked pos0-3)
       (locked pos0-1)
       (locked pos1-5)
       (locked pos2-2)
       (locked pos1-1)
       (locked pos1-0)
       (locked pos0-2)
       (locked pos0-0)
       (lock-shape  pos1-3 shape0)
       (lock-shape  pos2-4 shape1)
       (lock-shape  pos1-4 shape2)
       (lock-shape  pos2-5 shape1)
       (lock-shape  pos0-3 shape0)
       (lock-shape  pos0-1 shape1)
       (lock-shape  pos1-5 shape1)
       (lock-shape  pos2-2 shape1)
       (lock-shape  pos1-1 shape0)
       (lock-shape  pos1-0 shape2)
       (lock-shape  pos0-2 shape0)
       (lock-shape  pos0-0 shape2)
       (open pos0-4)
       (open pos0-5)
       (open pos1-2)
       (open pos2-0)
       (open pos2-1)
       (open pos2-3)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape2)
       (at key0 pos0-5)
       (at key1 pos1-2)
       (at key2 pos2-0)
       (at key3 pos1-4)
       (at-robot pos0-5)
    )

    (:goal (and
       (at key0 pos1-5)
       (at key1 pos1-1)
       (at key2 pos1-5)
       (at key3 pos2-0)
    )))

; plan
1. (pickup pos0-5 key0)
   deleted: (at key0 pos0-5) (arm-empty)
   added: (holding key0)
   goals met: 0 of 4
2. (move pos0-5 pos0-4)
   deleted: (at-robot pos0-5)
   added: (at-robot pos0-4)
   goals met: 0 of 4
3. (unlock pos0-4 pos0-3 key0 shape0)
   deleted: (locked pos0-3)
   added: (open pos0-3)
   goals met: 0 of 4
4. (move pos0-4 pos0-3)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-3)
   goals met: 0 of 4
5. (unlock pos0-3 pos1-3 key0 shape0)
   deleted: (locked pos1-3)
   added: (open pos1-3)
   goals met: 0 of 4
6. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 0 of 4
7. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 0 of 4
8. (unlock pos1-2 pos1-1 key0 shape0)
   deleted: (locked pos1-1)
   added: (open pos1-1)
   goals met: 0 of 4
9. (pickup-and-loose pos1-2 key1 key0)
   deleted: (holding key0) (at key1 pos1-2)
   added: (holding key1) (at key0 pos1-2)
   goals met: 0 of 4
10. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 0 of 4
11. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 0 of 4
12. (move pos2-1 pos2-0)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-0)
   goals met: 0 of 4
13. (pickup-and-loose pos2-0 key2 key1)
   deleted: (holding key1) (at key2 pos2-0)
   added: (holding key2) (at key1 pos2-0)
   goals met: 0 of 4
14. (move pos2-0 pos2-1)
   deleted: (at-robot pos2-0)
   added: (at-robot pos2-1)
   goals met: 0 of 4
15. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 0 of 4
16. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 0 of 4
17. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 0 of 4
18. (unlock pos1-3 pos1-4 key2 shape2)
   deleted: (locked pos1-4)
   added: (open pos1-4)
   goals met: 0 of 4
19. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 0 of 4
20. (pickup-and-loose pos1-4 key3 key2)
   deleted: (holding key2) (at key3 pos1-4)
   added: (holding key3) (at key2 pos1-4)
   goals met: 0 of 4
21. (move pos1-4 pos1-3)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-3)
   goals met: 0 of 4
22. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 0 of 4
23. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 0 of 4
24. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 0 of 4
25. (move pos2-1 pos2-0)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-0)
   goals met: 0 of 4
26. (pickup-and-loose pos2-0 key1 key3)
   deleted: (holding key3) (at key1 pos2-0)
   added: (holding key1) (at key3 pos2-0)
   goals met: 1 of 4
27. (move pos2-0 pos2-1)
   deleted: (at-robot pos2-0)
   added: (at-robot pos2-1)
   goals met: 1 of 4
28. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 1 of 4
29. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 1 of 4
30. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 1 of 4
31. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 1 of 4
32. (unlock pos1-4 pos1-5 key1 shape1)
   deleted: (locked pos1-5)
   added: (open pos1-5)
   goals met: 1 of 4
33. (move pos1-4 pos1-3)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-3)
   goals met: 1 of 4
34. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 1 of 4
35. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 1 of 4
36. (putdown pos1-1 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos1-1)
   goals met: 2 of 4
37. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 2 of 4
38. (pickup pos1-2 key0)
   deleted: (at key0 pos1-2) (arm-empty)
   added: (holding key0)
   goals met: 2 of 4
39. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 2 of 4
40. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 2 of 4
41. (move pos1-4 pos1-5)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-5)
   goals met: 2 of 4
42. (putdown pos1-5 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos1-5)
   goals met: 3 of 4
43. (move pos1-5 pos1-4)
   deleted: (at-robot pos1-5)
   added: (at-robot pos1-4)
   goals met: 3 of 4
44. (pickup pos1-4 key2)
   deleted: (at key2 pos1-4) (arm-empty)
   added: (holding key2)
   goals met: 3 of 4
45. (move pos1-4 pos1-5)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-5)
   goals met: 3 of 4
46. (putdown pos1-5 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos1-5)
   goals met: 4 of 4
